"1 107 1 4206624772 ,"
"energy 4 1 1 2880 2880 0 : image 4 1 1 2880 2880 0 : pyramid_lv0 4 1 1 2880 2880 0 : pyramid_lv1 4 1 1 1440 1440 0 : pyramid_lv2 4 1 1 720 720 0 : pyramid_lv3 4 1 1 360 360 0 : pyramid_lv4 4 1 1 180 180 0 : pyramid_lv5 4 1 1 90 90 0 ,"
" 114 132 150 155 16 160 186 204 222 227 232 258 276 294 299 304 330 348 366 371 376 381 394 401 402 407 42 420 427 428 433 446 453 454 459 472 479 480 485 498 505 506 509 535 553 571 597 60 615 633 634 660 678 696 697 698 699 700 702 703 704 705 707 708 712 713 715 716 717 721 722 724 725 726 730 731 733 734 735 739 740 742 743 744 748 749 751 752 753 78 83 88 energy image out_energy out_pyramid_lv0 out_pyramid_lv1 out_pyramid_lv2 out_pyramid_lv3 out_pyramid_lv4 out_pyramid_lv5 pyramid_lv0 pyramid_lv1 pyramid_lv2 pyramid_lv3 pyramid_lv4 pyramid_lv5 ,"
"out_energy out_pyramid_lv0 out_pyramid_lv1 out_pyramid_lv2 out_pyramid_lv3 out_pyramid_lv4 out_pyramid_lv5 ,"
" 99 ,"
"Cast Cast_0 1 1 image 16 0 ,"
"Pad Pad_17 1 1 16 42 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_26 1 1 42 60 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_35 1 1 60 78 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"StridedSliceV2 Slice_40 1 1 78 83 1 0 1 2147483647 1 2 1 2 ,"
"StridedSliceV2 Slice_45 1 1 83 88 1 0 1 2147483647 1 3 1 2 ,"
"Pad Pad_62 1 1 88 114 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_71 1 1 114 132 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_80 1 1 132 150 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"StridedSliceV2 Slice_85 1 1 150 155 1 0 1 2147483647 1 2 1 2 ,"
"StridedSliceV2 Slice_90 1 1 155 160 1 0 1 2147483647 1 3 1 2 ,"
"Pad Pad_107 1 1 160 186 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_116 1 1 186 204 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_125 1 1 204 222 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"StridedSliceV2 Slice_130 1 1 222 227 1 0 1 2147483647 1 2 1 2 ,"
"StridedSliceV2 Slice_135 1 1 227 232 1 0 1 2147483647 1 3 1 2 ,"
"Pad Pad_152 1 1 232 258 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_161 1 1 258 276 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_170 1 1 276 294 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"StridedSliceV2 Slice_175 1 1 294 299 1 0 1 2147483647 1 2 1 2 ,"
"StridedSliceV2 Slice_180 1 1 299 304 1 0 1 2147483647 1 3 1 2 ,"
"Pad Pad_197 1 1 304 330 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_206 1 1 330 348 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_215 1 1 348 366 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"StridedSliceV2 Slice_220 1 1 366 371 1 0 1 2147483647 1 2 1 2 ,"
"StridedSliceV2 Slice_225 1 1 371 376 1 0 1 2147483647 1 3 1 2 ,"
"Upsample Resize_227 1 1 376 381 2 2 2 1 ,"
"StridedSliceV2 Slice_236 1 1 381 394 1 0 1 180 1 2 1 1 ,"
"StridedSliceV2 Slice_239 1 1 394 401 1 0 1 180 1 3 1 1 ,"
"Sub Sub_240 2 1 304 401 402 -1 ,"
"Upsample Resize_242 1 1 304 407 2 2 2 1 ,"
"StridedSliceV2 Slice_251 1 1 407 420 1 0 1 360 1 2 1 1 ,"
"StridedSliceV2 Slice_254 1 1 420 427 1 0 1 360 1 3 1 1 ,"
"Sub Sub_255 2 1 232 427 428 -1 ,"
"Upsample Resize_257 1 1 232 433 2 2 2 1 ,"
"StridedSliceV2 Slice_266 1 1 433 446 1 0 1 720 1 2 1 1 ,"
"StridedSliceV2 Slice_269 1 1 446 453 1 0 1 720 1 3 1 1 ,"
"Sub Sub_270 2 1 160 453 454 -1 ,"
"Upsample Resize_272 1 1 160 459 2 2 2 1 ,"
"StridedSliceV2 Slice_281 1 1 459 472 1 0 1 1440 1 2 1 1 ,"
"StridedSliceV2 Slice_284 1 1 472 479 1 0 1 1440 1 3 1 1 ,"
"Sub Sub_285 2 1 88 479 480 -1 ,"
"Upsample Resize_287 1 1 88 485 2 2 2 1 ,"
"StridedSliceV2 Slice_296 1 1 485 498 1 0 1 2880 1 2 1 1 ,"
"StridedSliceV2 Slice_299 1 1 498 505 1 0 1 2880 1 3 1 1 ,"
"Sub Sub_300 2 1 16 505 506 -1 ,"
"Power Pow_301 1 1 506 509 2 1 0 ,"
"Pad Pad_318 1 1 509 535 0 0 20 20 20 20 0 0 1 0 ,"
"Convolution Conv_327 1 1 535 553 1 1 1 41 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_336 1 1 553 571 1 1 1 1 41 1 1 0 0 0 -1 1 1 0 ,"
"Pad Pad_353 1 1 509 597 0 0 2 2 2 2 0 0 1 0 ,"
"Convolution Conv_362 1 1 597 615 1 1 1 5 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_371 1 1 615 633 1 1 1 1 5 1 1 0 0 0 -1 1 1 0 ,"
"Add Add_372 2 1 571 633 634 -1 ,"
"Pad Pad_389 1 1 509 660 0 0 10 10 10 10 0 0 1 0 ,"
"Convolution Conv_398 1 1 660 678 1 1 1 21 1 1 1 0 0 0 -1 1 1 0 ,"
"Convolution Conv_407 1 1 678 696 1 1 1 1 21 1 1 0 0 0 -1 1 1 0 ,"
"Add Add_408 2 1 634 696 697 -1 ,"
"Greater Greater_409 2 1 697 energy 698 -1 ,"
"Cast Cast_410 1 1 698 699 0 ,"
"Mul Mul_411 2 1 697 699 700 -1 ,"
"Sub Sub_413 1 1 699 702 0 ,"
"Mul Mul_414 2 1 energy 702 703 -1 ,"
"Add Add_415 2 1 700 703 704 -1 ,"
"Mul Mul_416 2 1 506 699 705 -1 ,"
"Sub Sub_418 1 1 699 707 0 ,"
"Mul Mul_419 2 1 pyramid_lv0 707 708 -1 ,"
"Add Add_420 2 1 705 708 out_pyramid_lv0 -1 ,"
"Pooling AveragePool_423 1 1 699 712 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Mul Mul_424 2 1 480 712 713 -1 ,"
"Sub Sub_426 1 1 712 715 0 ,"
"Mul Mul_427 2 1 pyramid_lv1 715 716 -1 ,"
"Add Add_428 2 1 713 716 717 -1 ,"
"Cast Cast_429 1 1 717 out_pyramid_lv1 0 ,"
"Pooling AveragePool_432 1 1 712 721 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Mul Mul_433 2 1 454 721 722 -1 ,"
"Sub Sub_435 1 1 721 724 0 ,"
"Mul Mul_436 2 1 pyramid_lv2 724 725 -1 ,"
"Add Add_437 2 1 722 725 726 -1 ,"
"Cast Cast_438 1 1 726 out_pyramid_lv2 0 ,"
"Pooling AveragePool_441 1 1 721 730 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Mul Mul_442 2 1 428 730 731 -1 ,"
"Sub Sub_444 1 1 730 733 0 ,"
"Mul Mul_445 2 1 pyramid_lv3 733 734 -1 ,"
"Add Add_446 2 1 731 734 735 -1 ,"
"Cast Cast_447 1 1 735 out_pyramid_lv3 0 ,"
"Pooling AveragePool_450 1 1 730 739 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Mul Mul_451 2 1 402 739 740 -1 ,"
"Sub Sub_453 1 1 739 742 0 ,"
"Mul Mul_454 2 1 pyramid_lv4 742 743 -1 ,"
"Add Add_455 2 1 740 743 744 -1 ,"
"Cast Cast_456 1 1 744 out_pyramid_lv4 0 ,"
"Pooling AveragePool_459 1 1 739 748 1 2 2 2 2 0 0 -1 -1 -1 0 0 0 0 ,"
"Mul Mul_460 2 1 376 748 749 -1 ,"
"Sub Sub_462 1 1 748 751 0 ,"
"Mul Mul_463 2 1 pyramid_lv5 751 752 -1 ,"
"Add Add_464 2 1 749 752 753 -1 ,"
"Cast Cast_465 1 1 753 out_pyramid_lv5 0 ,"
"Cast Cast_466 1 1 704 out_energy 0 ,"
